infra/build/resources/yws_aws_ws01.wsdl

<?xml version="1.0" encoding="utf-8"?><wsdl:definitions targetNamespace="urn:sap-com:document:sap:rfc:functions" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:wsoap12="http://schemas.xmlsoap.org/wsdl/soap12/" xmlns:http="http://schemas.xmlsoap.org/wsdl/http/" xmlns:mime="http://schemas.xmlsoap.org/wsdl/mime/" xmlns:tns="urn:sap-com:document:sap:rfc:functions" xmlns:wsp="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"><wsdl:documentation><sidl:sidl xmlns:sidl="http://www.sap.com/2007/03/sidl"/></wsdl:documentation><wsp:UsingPolicy wsdl:required="true"/><wsp:Policy wsu:Id="BN__YWS_AWS_WS01"><wsp:ExactlyOne><wsp:All><sapattahnd:Enabled xmlns:sapattahnd="http://www.sap.com/710/features/attachment/">false</sapattahnd:Enabled><saptrnbnd:OptimizedMimeSerialization xmlns:saptrnbnd="http://schemas.xmlsoap.org/ws/2004/09/policy/optimizedmimeserialization" wsp:Optional="true"/><wsaw:UsingAddressing xmlns:wsaw="http://www.w3.org/2006/05/addressing/wsdl" wsp:Optional="true"/></wsp:All><wsp:All><sapattahnd:Enabled xmlns:sapattahnd="http://www.sap.com/710/features/attachment/">false</sapattahnd:Enabled><saptrnbnd:OptimizedXMLTransfer uri="http://xml.sap.com/2006/11/esi/esp/binxml" xmlns:saptrnbnd="http://www.sap.com/webas/710/soap/features/transportbinding/" wsp:Optional="true"/><wsaw:UsingAddressing xmlns:wsaw="http://www.w3.org/2006/05/addressing/wsdl" wsp:Optional="true"/></wsp:All></wsp:ExactlyOne></wsp:Policy><wsp:Policy wsu:Id="BN__YWS_AWS_WS01_soap12"><wsp:ExactlyOne><wsp:All><sapattahnd:Enabled xmlns:sapattahnd="http://www.sap.com/710/features/attachment/">false</sapattahnd:Enabled><saptrnbnd:OptimizedMimeSerialization xmlns:saptrnbnd="http://schemas.xmlsoap.org/ws/2004/09/policy/optimizedmimeserialization" wsp:Optional="true"/><wsaw:UsingAddressing xmlns:wsaw="http://www.w3.org/2006/05/addressing/wsdl" wsp:Optional="true"/></wsp:All><wsp:All><sapattahnd:Enabled xmlns:sapattahnd="http://www.sap.com/710/features/attachment/">false</sapattahnd:Enabled><saptrnbnd:OptimizedXMLTransfer uri="http://xml.sap.com/2006/11/esi/esp/binxml" xmlns:saptrnbnd="http://www.sap.com/webas/710/soap/features/transportbinding/" wsp:Optional="true"/><wsaw:UsingAddressing xmlns:wsaw="http://www.w3.org/2006/05/addressing/wsdl" wsp:Optional="true"/></wsp:All></wsp:ExactlyOne></wsp:Policy><wsp:Policy wsu:Id="IF__YWS_AWS_WS01"><wsp:ExactlyOne><wsp:All><sapsession:Session xmlns:sapsession="http://www.sap.com/webas/630/soap/features/session/"><sapsession:enableSession>false</sapsession:enableSession></sapsession:Session><sapcentraladmin:CentralAdministration xmlns:sapcentraladmin="http://www.sap.com/webas/700/soap/features/CentralAdministration/" wsp:Optional="true"><sapcentraladmin:BusinessApplicationID>1240C56B672B1EDAB6A75161EBF13549</sapcentraladmin:BusinessApplicationID></sapcentraladmin:CentralAdministration></wsp:All></wsp:ExactlyOne></wsp:Policy><wsp:Policy wsu:Id="OP__YFM_AWS_WS01"><wsp:ExactlyOne><wsp:All><saptrhnw05:required xmlns:saptrhnw05="http://www.sap.com/NW05/soap/features/transaction/">no</saptrhnw05:required><sapcomhnd:enableCommit xmlns:sapcomhnd="http://www.sap.com/NW05/soap/features/commit/">false</sapcomhnd:enableCommit><sapblock:enableBlocking xmlns:sapblock="http://www.sap.com/NW05/soap/features/blocking/">true</sapblock:enableBlocking><saprmnw05:enableWSRM xmlns:saprmnw05="http://www.sap.com/NW05/soap/features/wsrm/">false</saprmnw05:enableWSRM></wsp:All></wsp:ExactlyOne></wsp:Policy><wsdl:types><xsd:schema attributeFormDefault="qualified" targetNamespace="urn:sap-com:document:sap:rfc:functions"><xsd:simpleType name="char10"><xsd:restriction base="xsd:string"><xsd:maxLength value="10"/></xsd:restriction></xsd:simpleType><xsd:simpleType name="char40"><xsd:restriction base="xsd:string"><xsd:maxLength value="40"/></xsd:restriction></xsd:simpleType><xsd:simpleType name="string"><xsd:restriction base="xsd:string"/></xsd:simpleType><xsd:element name="YFM_AWS_WS01"><xsd:complexType><xsd:sequence><xsd:element name="IP_FIRSTNAME" type="tns:char40" minOccurs="0"/><xsd:element name="IP_LASTNAME" type="tns:char40" minOccurs="0"/><xsd:element name="IP_TITLE" type="tns:char10" minOccurs="0"/></xsd:sequence></xsd:complexType></xsd:element><xsd:element name="YFM_AWS_WS01Response"><xsd:complexType><xsd:sequence><xsd:element name="EP_NAME" type="tns:string"/></xsd:sequence></xsd:complexType></xsd:element></xsd:schema></wsdl:types><wsdl:message name="YFM_AWS_WS01"><wsdl:part name="parameters" element="tns:YFM_AWS_WS01"/></wsdl:message><wsdl:message name="YFM_AWS_WS01Response"><wsdl:part name="parameter" element="tns:YFM_AWS_WS01Response"/></wsdl:message><wsdl:portType name="YWS_AWS_WS01"><wsdl:documentation><sapdoc:sapdoc xmlns:sapdoc="urn:sap:esi:documentation"><sapdoc:docitem applicationComponent="AP"/></sapdoc:sapdoc></wsdl:documentation><wsp:Policy><wsp:PolicyReference URI="#IF__YWS_AWS_WS01"/></wsp:Policy><wsdl:operation name="YFM_AWS_WS01"><wsp:Policy><wsp:PolicyReference URI="#OP__YFM_AWS_WS01"/></wsp:Policy><wsdl:input message="tns:YFM_AWS_WS01"/><wsdl:output message="tns:YFM_AWS_WS01Response"/></wsdl:operation></wsdl:portType><wsdl:binding name="YWS_AWS_WS01" type="tns:YWS_AWS_WS01"><wsp:Policy><wsp:PolicyReference URI="#BN__YWS_AWS_WS01"/></wsp:Policy><soap:binding transport="http://schemas.xmlsoap.org/soap/http" style="document"/><wsdl:operation name="YFM_AWS_WS01"><soap:operation soapAction="urn:sap-com:document:sap:rfc:functions:YWS_AWS_WS01:YFM_AWS_WS01Request" style="document"/><wsdl:input><soap:body use="literal"/></wsdl:input><wsdl:output><soap:body use="literal"/></wsdl:output></wsdl:operation></wsdl:binding><wsdl:binding name="YWS_AWS_WS01_soap12" type="tns:YWS_AWS_WS01"><wsp:Policy><wsp:PolicyReference URI="#BN__YWS_AWS_WS01_soap12"/></wsp:Policy><wsoap12:binding transport="http://schemas.xmlsoap.org/soap/http" style="document"/><wsdl:operation name="YFM_AWS_WS01"><wsoap12:operation soapAction="urn:sap-com:document:sap:rfc:functions:YWS_AWS_WS01:YFM_AWS_WS01Request" style="document"/><wsdl:input><wsoap12:body use="literal"/></wsdl:input><wsdl:output><wsoap12:body use="literal"/></wsdl:output></wsdl:operation></wsdl:binding><wsdl:service name="YWS_AWS_WS01"><wsdl:port name="YWS_AWS_WS01" binding="tns:YWS_AWS_WS01"><soap:address location="http://vhcalnplci.dummy.nodomain:8000/sap/bc/srt/rfc/sap/yws_aws_ws01/001/yws_aws_ws01/yws_aws_ws01"/></wsdl:port><wsdl:port name="YWS_AWS_WS01_soap12" binding="tns:YWS_AWS_WS01_soap12"><wsoap12:address location="http://vhcalnplci.dummy.nodomain:8000/sap/bc/srt/rfc/sap/yws_aws_ws01/001/yws_aws_ws01/yws_aws_ws01"/></wsdl:port></wsdl:service></wsdl:definitions>